{
  "description": "### 18.15 realtime, arealtime\n\nSlow down filtering to match real time approximately.\n\nThese filters will pause the filtering for a variable amount of time to match\nthe output rate with the input timestamps. They are similar to the re option\nto `ffmpeg`.\n\nThey accept the following options:\n\n**limit**\n\n    Time limit for the pauses. Any pause longer than that will be considered a timestamp discontinuity and reset the timer. Default is 2 seconds. \n\n**speed**\n\n    Speed factor for processing. The value must be a float larger than zero. Values larger than 1.0 will result in faster than realtime processing, smaller will slow processing down. The limit is automatically adapted accordingly. Default is 1.0. A processing speed faster than what is possible without these filters cannot be achieved. \n\n",
  "filter_type": "af",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_af_arealtime",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_AUDIO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "name": "arealtime",
  "options": [
    {
      "alias": [
        "limit"
      ],
      "choices": [],
      "default": 2000000,
      "description": "<dd><p>Time limit for the pauses. Any pause longer than that will be considered\na timestamp discontinuity and reset the timer. Default is 2 seconds.\n</p></dd>",
      "name": "limit",
      "required": false,
      "typing": "int"
    },
    {
      "alias": [
        "speed"
      ],
      "choices": [],
      "default": 1.0,
      "description": "<dd><p>Speed factor for processing. The value must be a float larger than zero.\nValues larger than 1.0 will result in faster than realtime processing,\nsmaller will slow processing down. The <var>limit</var> is automatically adapted\naccordingly. Default is 1.0.\n</p>\n<p>A processing speed faster than what is possible without these filters cannot\nbe achieved.\n</p></dd>",
      "name": "speed",
      "required": false,
      "typing": "float"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_AUDIO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#realtime_002c-arealtime"
}
