{
  "description": "### 11.231 showinfo\n\nShow a line containing various information for each input video frame. The\ninput video is not modified.\n\nThis filter supports the following options:\n\n**checksum**\n\n    Calculate checksums of each plane. By default enabled. \n\nThe shown line contains a sequence of key/value pairs of the form key:value.\n\nThe following values are shown in the output:\n\n**n**\n\n    The (sequential) number of the input frame, starting from 0. \n\n**pts**\n\n    The Presentation TimeStamp of the input frame, expressed as a number of time base units. The time base unit depends on the filter input pad. \n\n**pts_time**\n\n    The Presentation TimeStamp of the input frame, expressed as a number of seconds. \n\n**fmt**\n\n    The pixel format name. \n\n**sar**\n\n    The sample aspect ratio of the input frame, expressed in the form num/den. \n\n**s**\n\n    The size of the input frame. For the syntax of this option, check the (ffmpeg-utils)\"Video size\" section in the ffmpeg-utils manual. \n\n**i**\n\n    The type of interlaced mode (\"P\" for \"progressive\", \"T\" for top field first, \"B\" for bottom field first). \n\n**iskey**\n\n    This is 1 if the frame is a key frame, 0 otherwise. \n\n**type**\n\n    The picture type of the input frame (\"I\" for an I-frame, \"P\" for a P-frame, \"B\" for a B-frame, or \"?\" for an unknown type). Also refer to the documentation of the AVPictureType enum and of the av_get_picture_type_char function defined in libavutil/avutil.h. \n\n**checksum**\n\n    The Adler-32 checksum (printed in hexadecimal) of all the planes of the input frame. \n\n**plane_checksum**\n\n    The Adler-32 checksum (printed in hexadecimal) of each plane of the input frame, expressed in the form \"[c0 c1 c2 c3]\". \n\n**mean**\n\n    The mean value of pixels in each plane of the input frame, expressed in the form \"[mean0 mean1 mean2 mean3]\". \n\n**stdev**\n\n    The standard deviation of pixel values in each plane of the input frame, expressed in the form \"[stdev0 stdev1 stdev2 stdev3]\". \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_showinfo",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "name": "showinfo",
  "options": [
    {
      "alias": [
        "checksum"
      ],
      "choices": [],
      "default": 1,
      "description": "<dd><p>Calculate checksums of each plane. By default enabled.\n</p></dd>",
      "name": "checksum",
      "required": false,
      "typing": "bool"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#showinfo"
}
