{
  "description": "### 11.122 hwmap\n\nMap hardware frames to system memory or to another device.\n\nThis filter has several different modes of operation; which one is used\ndepends on the input and output formats:\n\n  * Hardware frame input, normal frame output \n\nMap the input frames to system memory and pass them to the output. If the\noriginal hardware frame is later required (for example, after overlaying\nsomething else on part of it), the hwmap filter can be used again in the next\nmode to retrieve it.\n\n  * Normal frame input, hardware frame output \n\nIf the input is actually a software-mapped hardware frame, then unmap it -\nthat is, return the original hardware frame.\n\nOtherwise, a device must be provided. Create new hardware surfaces on that\ndevice for the output, then map them back to the software format at the input\nand give those frames to the preceding filter. This will then act like the\nhwupload filter, but may be able to avoid an additional copy when the input is\nalready in a compatible format.\n\n  * Hardware frame input and output \n\nA device must be supplied for the output, either directly or with the\nderive_device option. The input and output devices must be of different types\nand compatible - the exact meaning of this is system-dependent, but typically\nit means that they must refer to the same underlying hardware context (for\nexample, refer to the same graphics card).\n\nIf the input frames were originally created on the output device, then unmap\nto retrieve the original frames.\n\nOtherwise, map the frames to the output device - create new hardware frames on\nthe output corresponding to the frames on the input.\n\nThe following additional parameters are accepted:\n\n**mode**\n\n    Set the frame mapping mode. Some combination of: read The mapped frame should be readable. write The mapped frame should be writeable. overwrite The mapping will always overwrite the entire frame. This may improve performance in some cases, as the original contents of the frame need not be loaded. direct The mapping must not involve any copying. Indirect mappings to copies of frames are created in some cases where either direct mapping is not possible or it would have unexpected properties. Setting this flag ensures that the mapping is direct and will fail if that is not possible. Defaults to read+write if not specified. \n\n**derive_device type**\n\n    Rather than using the device supplied at initialisation, instead derive a new device of type type from the device the input frames exist on. \n\n**reverse**\n\n    In a hardware to hardware mapping, map in reverse - create frames in the sink and map them back to the source. This may be necessary in some cases where a mapping in one direction is required but only the opposite direction is supported by the devices being used. This option is dangerous - it may break the preceding filter in undefined ways if there are any additional constraints on that filter’s output. Do not use it without fully understanding the implications of its use. \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_hwmap",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "name": "hwmap",
  "options": [
    {
      "alias": [
        "mode"
      ],
      "choices": [
        {
          "help": "Mapping should be readable",
          "name": "read",
          "value": "AV_HWFRAME_MAP_READ"
        },
        {
          "help": "Mapping should be writeable",
          "name": "write",
          "value": "AV_HWFRAME_MAP_WRITE"
        },
        {
          "help": "Mapping will always overwrite the entire frame",
          "name": "overwrite",
          "value": "AV_HWFRAME_MAP_OVERWRITE"
        },
        {
          "help": "Mapping should not involve any copying",
          "name": "direct",
          "value": "AV_HWFRAME_MAP_DIRECT"
        }
      ],
      "default": "AV_HWFRAME_MAP_READ | AV_HWFRAME_MAP_WRITE",
      "description": "<dd><p>Set the frame mapping mode.  Some combination of:\n</p><dl compact=\"compact\">\n<dt><var>read</var></dt>\n<dd><p>The mapped frame should be readable.\n</p></dd>\n<dt><var>write</var></dt>\n<dd><p>The mapped frame should be writeable.\n</p></dd>\n<dt><var>overwrite</var></dt>\n<dd><p>The mapping will always overwrite the entire frame.\n</p>\n<p>This may improve performance in some cases, as the original contents of the\nframe need not be loaded.\n</p></dd>\n<dt><var>direct</var></dt>\n<dd><p>The mapping must not involve any copying.\n</p>\n<p>Indirect mappings to copies of frames are created in some cases where either\ndirect mapping is not possible or it would have unexpected properties.\nSetting this flag ensures that the mapping is direct and will fail if that is\nnot possible.\n</p></dd>\n</dl>\n<p>Defaults to <var>read+write</var> if not specified.\n</p>\n</dd>",
      "name": "mode",
      "required": false,
      "typing": "str"
    },
    {
      "alias": [
        "derive_device"
      ],
      "choices": [],
      "default": "((void*)0)",
      "description": "<dd><p>Rather than using the device supplied at initialisation, instead derive a new\ndevice of type <var>type</var> from the device the input frames exist on.\n</p>\n</dd>",
      "name": "derive_device",
      "required": true,
      "typing": "str"
    },
    {
      "alias": [
        "reverse"
      ],
      "choices": [],
      "default": 0,
      "description": "<dd><p>In a hardware to hardware mapping, map in reverse - create frames in the sink\nand map them back to the source.  This may be necessary in some cases where\na mapping in one direction is required but only the opposite direction is\nsupported by the devices being used.\n</p>\n<p>This option is dangerous - it may break the preceding filter in undefined\nways if there are any additional constraints on that filter’s output.\nDo not use it without fully understanding the implications of its use.\n</p></dd>",
      "name": "reverse",
      "required": false,
      "typing": "int"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#hwmap"
}
