{
  "description": "### 11.135 idet\n\nDetect video interlacing type.\n\nThis filter tries to detect if the input frames are interlaced, progressive,\ntop or bottom field first. It will also try to detect fields that are repeated\nbetween adjacent frames (a sign of telecine).\n\nSingle frame detection considers only immediately adjacent frames when\nclassifying each frame. Multiple frame detection incorporates the\nclassification history of previous frames.\n\nThe filter will log these metadata values:\n\n**single.current_frame**\n\n    Detected type of current frame using single-frame detection. One of: “tff” (top field first), “bff” (bottom field first), “progressive”, or “undetermined” \n\n**single.tff**\n\n    Cumulative number of frames detected as top field first using single-frame detection. \n\n**multiple.tff**\n\n    Cumulative number of frames detected as top field first using multiple-frame detection. \n\n**single.bff**\n\n    Cumulative number of frames detected as bottom field first using single-frame detection. \n\n**multiple.current_frame**\n\n    Detected type of current frame using multiple-frame detection. One of: “tff” (top field first), “bff” (bottom field first), “progressive”, or “undetermined” \n\n**multiple.bff**\n\n    Cumulative number of frames detected as bottom field first using multiple-frame detection. \n\n**single.progressive**\n\n    Cumulative number of frames detected as progressive using single-frame detection. \n\n**multiple.progressive**\n\n    Cumulative number of frames detected as progressive using multiple-frame detection. \n\n**single.undetermined**\n\n    Cumulative number of frames that could not be classified using single-frame detection. \n\n**multiple.undetermined**\n\n    Cumulative number of frames that could not be classified using multiple-frame detection. \n\n**repeated.current_frame**\n\n    Which field in the current frame is repeated from the last. One of “neither”, “top”, or “bottom”. \n\n**repeated.neither**\n\n    Cumulative number of frames with no repeated field. \n\n**repeated.top**\n\n    Cumulative number of frames with the top field repeated from the previous frame’s top field. \n\n**repeated.bottom**\n\n    Cumulative number of frames with the bottom field repeated from the previous frame’s bottom field. \n\nThe filter accepts the following options:\n\n**intl_thres**\n\n    Set interlacing threshold. \n\n**prog_thres**\n\n    Set progressive threshold. \n\n**rep_thres**\n\n    Threshold for repeated field detection. \n\n**half_life**\n\n    Number of frames after which a given frame’s contribution to the statistics is halved (i.e., it contributes only 0.5 to its classification). The default of 0 means that all frames seen are given full weight of 1.0 forever. \n\n**analyze_interlaced_flag**\n\n    When this is not 0 then idet will use the specified number of frames to determine if the interlaced flag is accurate, it will not count undetermined frames. If the flag is found to be accurate it will be used without any further computations, if it is found to be inaccurate it will be cleared without any further computations. This allows inserting the idet filter as a low computational method to clean up the interlaced flag \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_idet",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "is_support_timeline": false,
  "name": "idet",
  "options": [
    {
      "alias": [
        "intl_thres"
      ],
      "choices": [],
      "default": 1.04,
      "description": "<dd><p>Set interlacing threshold.\n</p></dd>",
      "name": "intl_thres",
      "required": false,
      "typing": "float"
    },
    {
      "alias": [
        "prog_thres"
      ],
      "choices": [],
      "default": 1.5,
      "description": "<dd><p>Set progressive threshold.\n</p></dd>",
      "name": "prog_thres",
      "required": false,
      "typing": "float"
    },
    {
      "alias": [
        "rep_thres"
      ],
      "choices": [],
      "default": 3.0,
      "description": "<dd><p>Threshold for repeated field detection.\n</p></dd>",
      "name": "rep_thres",
      "required": false,
      "typing": "float"
    },
    {
      "alias": [
        "half_life"
      ],
      "choices": [],
      "default": 0.0,
      "description": "<dd><p>Number of frames after which a given frame’s contribution to the\nstatistics is halved (i.e., it contributes only 0.5 to its\nclassification). The default of 0 means that all frames seen are given\nfull weight of 1.0 forever.\n</p></dd>",
      "name": "half_life",
      "required": false,
      "typing": "float"
    },
    {
      "alias": [
        "analyze_interlaced_flag"
      ],
      "choices": [],
      "default": 0,
      "description": "<dd><p>When this is not 0 then idet will use the specified number of frames to determine\nif the interlaced flag is accurate, it will not count undetermined frames.\nIf the flag is found to be accurate it will be used without any further\ncomputations, if it is found to be inaccurate it will be cleared without any\nfurther computations. This allows inserting the idet filter as a low computational\nmethod to clean up the interlaced flag\n</p></dd>",
      "name": "analyze_interlaced_flag",
      "required": false,
      "typing": "int"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#idet"
}
