{
  "description": "### 11.236 signalstats\n\nEvaluate various visual metrics that assist in determining issues associated\nwith the digitization of analog video media.\n\nBy default the filter will log these metadata values:\n\n**YMIN**\n\n    Display the minimal Y value contained within the input frame. Expressed in range of [0-255]. \n\n**YLOW**\n\n    Display the Y value at the 10% percentile within the input frame. Expressed in range of [0-255]. \n\n**YAVG**\n\n    Display the average Y value within the input frame. Expressed in range of [0-255]. \n\n**YHIGH**\n\n    Display the Y value at the 90% percentile within the input frame. Expressed in range of [0-255]. \n\n**YMAX**\n\n    Display the maximum Y value contained within the input frame. Expressed in range of [0-255]. \n\n**UMIN**\n\n    Display the minimal U value contained within the input frame. Expressed in range of [0-255]. \n\n**ULOW**\n\n    Display the U value at the 10% percentile within the input frame. Expressed in range of [0-255]. \n\n**UAVG**\n\n    Display the average U value within the input frame. Expressed in range of [0-255]. \n\n**UHIGH**\n\n    Display the U value at the 90% percentile within the input frame. Expressed in range of [0-255]. \n\n**UMAX**\n\n    Display the maximum U value contained within the input frame. Expressed in range of [0-255]. \n\n**VMIN**\n\n    Display the minimal V value contained within the input frame. Expressed in range of [0-255]. \n\n**VLOW**\n\n    Display the V value at the 10% percentile within the input frame. Expressed in range of [0-255]. \n\n**VAVG**\n\n    Display the average V value within the input frame. Expressed in range of [0-255]. \n\n**VHIGH**\n\n    Display the V value at the 90% percentile within the input frame. Expressed in range of [0-255]. \n\n**VMAX**\n\n    Display the maximum V value contained within the input frame. Expressed in range of [0-255]. \n\n**SATMIN**\n\n    Display the minimal saturation value contained within the input frame. Expressed in range of [0-~181.02]. \n\n**SATLOW**\n\n    Display the saturation value at the 10% percentile within the input frame. Expressed in range of [0-~181.02]. \n\n**SATAVG**\n\n    Display the average saturation value within the input frame. Expressed in range of [0-~181.02]. \n\n**SATHIGH**\n\n    Display the saturation value at the 90% percentile within the input frame. Expressed in range of [0-~181.02]. \n\n**SATMAX**\n\n    Display the maximum saturation value contained within the input frame. Expressed in range of [0-~181.02]. \n\n**HUEMED**\n\n    Display the median value for hue within the input frame. Expressed in range of [0-360]. \n\n**HUEAVG**\n\n    Display the average value for hue within the input frame. Expressed in range of [0-360]. \n\n**YDIF**\n\n    Display the average of sample value difference between all values of the Y plane in the current frame and corresponding values of the previous input frame. Expressed in range of [0-255]. \n\n**UDIF**\n\n    Display the average of sample value difference between all values of the U plane in the current frame and corresponding values of the previous input frame. Expressed in range of [0-255]. \n\n**VDIF**\n\n    Display the average of sample value difference between all values of the V plane in the current frame and corresponding values of the previous input frame. Expressed in range of [0-255]. \n\n**YBITDEPTH**\n\n    Display bit depth of Y plane in current frame. Expressed in range of [0-16]. \n\n**UBITDEPTH**\n\n    Display bit depth of U plane in current frame. Expressed in range of [0-16]. \n\n**VBITDEPTH**\n\n    Display bit depth of V plane in current frame. Expressed in range of [0-16]. \n\nThe filter accepts the following options:\n\n**stat**\n\n**out**\n\n     stat specify an additional form of image analysis. out output video with the specified type of pixel highlighted. Both options accept the following values: ‘tout’ Identify temporal outliers pixels. A temporal outlier is a pixel unlike the neighboring pixels of the same field. Examples of temporal outliers include the results of video dropouts, head clogs, or tape tracking issues. ‘vrep’ Identify vertical line repetition. Vertical line repetition includes similar rows of pixels within a frame. In born-digital video vertical line repetition is common, but this pattern is uncommon in video digitized from an analog source. When it occurs in video that results from the digitization of an analog source it can indicate concealment from a dropout compensator. ‘brng’ Identify pixels that fall outside of legal broadcast range. \n\n**color, c**\n\n    Set the highlight color for the out option. The default color is yellow. \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_signalstats",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "is_support_framesync": false,
  "is_support_timeline": false,
  "name": "signalstats",
  "options": [
    {
      "alias": [
        "stat"
      ],
      "choices": [
        {
          "help": "analyze pixels for temporal outliers",
          "name": "tout",
          "value": "1<<FILTER_TOUT"
        },
        {
          "help": "analyze video lines for vertical line repetition",
          "name": "vrep",
          "value": "1<<FILTER_VREP"
        },
        {
          "help": "analyze for pixels outside of broadcast range",
          "name": "brng",
          "value": "1<<FILTER_BRNG"
        }
      ],
      "default": 0,
      "description": "<dd>\n<p><samp>stat</samp> specify an additional form of image analysis.\n<samp>out</samp> output video with the specified type of pixel highlighted.\n</p>\n<p>Both options accept the following values:\n</p>\n<dl compact=\"compact\">\n<dt>‘<samp>tout</samp>’</dt>\n<dd><p>Identify <var>temporal outliers</var> pixels. A <var>temporal outlier</var> is a pixel\nunlike the neighboring pixels of the same field. Examples of temporal outliers\ninclude the results of video dropouts, head clogs, or tape tracking issues.\n</p>\n</dd>\n<dt>‘<samp>vrep</samp>’</dt>\n<dd><p>Identify <var>vertical line repetition</var>. Vertical line repetition includes\nsimilar rows of pixels within a frame. In born-digital video vertical line\nrepetition is common, but this pattern is uncommon in video digitized from an\nanalog source. When it occurs in video that results from the digitization of an\nanalog source it can indicate concealment from a dropout compensator.\n</p>\n</dd>\n<dt>‘<samp>brng</samp>’</dt>\n<dd><p>Identify pixels that fall outside of legal broadcast range.\n</p></dd>\n</dl>\n</dd>",
      "name": "stat",
      "required": false,
      "typing": "str"
    },
    {
      "alias": [
        "out"
      ],
      "choices": [
        {
          "help": "highlight pixels that depict temporal outliers",
          "name": "tout",
          "value": "FILTER_TOUT"
        },
        {
          "help": "highlight video lines that depict vertical line repetition",
          "name": "vrep",
          "value": "FILTER_VREP"
        },
        {
          "help": "highlight pixels that are outside of broadcast range",
          "name": "brng",
          "value": "FILTER_BRNG"
        }
      ],
      "default": "FILTER_NONE",
      "description": "<dd>\n<p><samp>stat</samp> specify an additional form of image analysis.\n<samp>out</samp> output video with the specified type of pixel highlighted.\n</p>\n<p>Both options accept the following values:\n</p>\n<dl compact=\"compact\">\n<dt>‘<samp>tout</samp>’</dt>\n<dd><p>Identify <var>temporal outliers</var> pixels. A <var>temporal outlier</var> is a pixel\nunlike the neighboring pixels of the same field. Examples of temporal outliers\ninclude the results of video dropouts, head clogs, or tape tracking issues.\n</p>\n</dd>\n<dt>‘<samp>vrep</samp>’</dt>\n<dd><p>Identify <var>vertical line repetition</var>. Vertical line repetition includes\nsimilar rows of pixels within a frame. In born-digital video vertical line\nrepetition is common, but this pattern is uncommon in video digitized from an\nanalog source. When it occurs in video that results from the digitization of an\nanalog source it can indicate concealment from a dropout compensator.\n</p>\n</dd>\n<dt>‘<samp>brng</samp>’</dt>\n<dd><p>Identify pixels that fall outside of legal broadcast range.\n</p></dd>\n</dl>\n</dd>",
      "name": "out",
      "required": false,
      "typing": "int"
    },
    {
      "alias": [
        "c",
        "color"
      ],
      "choices": [],
      "default": "yellow",
      "description": "<dd><p>Set the highlight color for the <samp>out</samp> option. The default color is\nyellow.\n</p></dd>",
      "name": "c",
      "required": false,
      "typing": "str"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#signalstats"
}
