{
  "description": "### 11.93 fieldhint\n\nCreate new frames by copying the top and bottom fields from surrounding frames\nsupplied as numbers by the hint file.\n\n**hint**\n\n    Set file containing hints: absolute/relative frame numbers. There must be one line for each frame in a clip. Each line must contain two numbers separated by the comma, optionally followed by - or +. Numbers supplied on each line of file can not be out of [N-1,N+1] where N is current frame number for absolute mode or out of [-1, 1] range for relative mode. First number tells from which frame to pick up top field and second number tells from which frame to pick up bottom field. If optionally followed by + output frame will be marked as interlaced, else if followed by - output frame will be marked as progressive, else it will be marked same as input frame. If optionally followed by t output frame will use only top field, or in case of b it will use only bottom field. If line starts with # or ; that line is skipped. \n\n**mode**\n\n    Can be item absolute or relative or pattern. Default is absolute. The pattern mode is same as relative mode, except at last entry of file if there are more frames to process than hint file is seek back to start. \n\nExample of first several lines of `hint` file for `relative` mode:\n\n    \n    \n    0,0 - # first frame\n    1,0 - # second frame, use third's frame top field and second's frame bottom field\n    1,0 - # third frame, use fourth's frame top field and third's frame bottom field\n    1,0 -\n    0,0 -\n    0,0 -\n    1,0 -\n    1,0 -\n    1,0 -\n    0,0 -\n    0,0 -\n    1,0 -\n    1,0 -\n    1,0 -\n    0,0 -\n    \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_fieldhint",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "name": "fieldhint",
  "options": [
    {
      "alias": [
        "hint"
      ],
      "choices": [],
      "default": "((void*)0)",
      "description": "<dd><p>Set file containing hints: absolute/relative frame numbers.\n</p>\n<p>There must be one line for each frame in a clip. Each line must contain two\nnumbers separated by the comma, optionally followed by <code>-</code> or <code>+</code>.\nNumbers supplied on each line of file can not be out of [N-1,N+1] where N\nis current frame number for <code>absolute</code> mode or out of [-1, 1] range\nfor <code>relative</code> mode. First number tells from which frame to pick up top\nfield and second number tells from which frame to pick up bottom field.\n</p>\n<p>If optionally followed by <code>+</code> output frame will be marked as interlaced,\nelse if followed by <code>-</code> output frame will be marked as progressive, else\nit will be marked same as input frame.\nIf optionally followed by <code>t</code> output frame will use only top field, or in\ncase of <code>b</code> it will use only bottom field.\nIf line starts with <code>#</code> or <code>;</code> that line is skipped.\n</p>\n</dd>",
      "name": "hint",
      "required": true,
      "typing": "str"
    },
    {
      "alias": [
        "mode"
      ],
      "choices": [
        {
          "help": "0",
          "name": "absolute",
          "value": "ABSOLUTE_HINT"
        },
        {
          "help": "0",
          "name": "relative",
          "value": "RELATIVE_HINT"
        },
        {
          "help": "0",
          "name": "pattern",
          "value": "PATTERN_HINT"
        }
      ],
      "default": 0,
      "description": "<dd><p>Can be item <code>absolute</code> or <code>relative</code> or <code>pattern</code>. Default is <code>absolute</code>.\nThe <code>pattern</code> mode is same as <code>relative</code> mode, except at last entry of file if there\nare more frames to process than <code>hint</code> file is seek back to start.\n</p></dd>",
      "name": "mode",
      "required": false,
      "typing": "int"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#fieldhint"
}
