{
  "description": "### 11.200 psnr\n\nObtain the average, maximum and minimum PSNR (Peak Signal to Noise Ratio)\nbetween two input videos.\n\nThis filter takes in input two input videos, the first input is considered the\n\"main\" source and is passed unchanged to the output. The second input is used\nas a \"reference\" video for computing the PSNR.\n\nBoth video inputs must have the same resolution and pixel format for this\nfilter to work correctly. Also it assumes that both inputs have the same\nnumber of frames, which are compared one by one.\n\nThe obtained average PSNR is printed through the logging system.\n\nThe filter stores the accumulated MSE (mean squared error) of each frame, and\nat the end of the processing it is averaged across all frames equally, and the\nfollowing formula is applied to obtain the PSNR:\n\n    \n    \n    PSNR = 10*log10(MAX^2/MSE)\n    \n\nWhere MAX is the average of the maximum values of each component of the image.\n\nThe description of the accepted parameters follows.\n\n**stats_file, f**\n\n    If specified the filter will use the named file to save the PSNR of each individual frame. When filename equals \"-\" the data is sent to standard output. \n\n**stats_version**\n\n    Specifies which version of the stats file format to use. Details of each format are written below. Default value is 1. \n\n**stats_add_max**\n\n    Determines whether the max value is output to the stats log. Default value is 0. Requires stats_version >= 2. If this is set and stats_version < 2, the filter will return an error. \n\nThis filter also supports the framesync options.\n\nThe file printed if stats_file is selected, contains a sequence of key/value\npairs of the form key:value for each compared couple of frames.\n\nIf a stats_version greater than 1 is specified, a header line precedes the\nlist of per-frame-pair stats, with key value pairs following the frame format\nwith the following parameters:\n\n**psnr_log_version**\n\n    The version of the log file format. Will match stats_version. \n\n**fields**\n\n    A comma separated list of the per-frame-pair parameters included in the log. \n\nA description of each shown per-frame-pair parameter follows:\n\n**n**\n\n    sequential number of the input frame, starting from 1 \n\n**mse_avg**\n\n    Mean Square Error pixel-by-pixel average difference of the compared frames, averaged over all the image components. \n\n**mse_y, mse_u, mse_v, mse_r, mse_g, mse_b, mse_a**\n\n    Mean Square Error pixel-by-pixel average difference of the compared frames for the component specified by the suffix. \n\n**psnr_y, psnr_u, psnr_v, psnr_r, psnr_g, psnr_b, psnr_a**\n\n    Peak Signal to Noise ratio of the compared frames for the component specified by the suffix. \n\n**max_avg, max_y, max_u, max_v**\n\n    Maximum allowed value for each channel, and average over all channels. \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_psnr",
  "input_stream_typings": [
    {
      "name": "main",
      "type": "AVMEDIA_TYPE_VIDEO"
    },
    {
      "name": "reference",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "is_support_timeline": true,
  "name": "psnr",
  "options": [
    {
      "alias": [
        "stats_file",
        "f"
      ],
      "choices": [],
      "default": "((void*)0)",
      "description": "<dd><p>If specified the filter will use the named file to save the PSNR of\neach individual frame. When filename equals \"-\" the data is sent to\nstandard output.\n</p>\n</dd>",
      "name": "stats_file",
      "required": false,
      "typing": "str"
    },
    {
      "alias": [
        "stats_version"
      ],
      "choices": [],
      "default": 1,
      "description": "<dd><p>Specifies which version of the stats file format to use. Details of\neach format are written below.\nDefault value is 1.\n</p>\n</dd>",
      "name": "stats_version",
      "required": false,
      "typing": "int"
    },
    {
      "alias": [
        "output_max"
      ],
      "choices": [],
      "default": 0,
      "description": "Add raw stats (max values) to the output log.",
      "name": "output_max",
      "required": false,
      "typing": "bool"
    },
    {
      "alias": [],
      "choices": [],
      "default": null,
      "description": "timeline editing",
      "name": "enable",
      "required": false,
      "typing": "str"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#psnr"
}
