{
  "description": "### 11.111 gradfun\n\nFix the banding artifacts that are sometimes introduced into nearly flat\nregions by truncation to 8-bit color depth. Interpolate the gradients that\nshould go where the bands are, and dither them.\n\nIt is designed for playback only. Do not use it prior to lossy compression,\nbecause compression tends to lose the dither and bring back the bands.\n\nIt accepts the following parameters:\n\n**strength**\n\n    The maximum amount by which the filter will change any one pixel. This is also the threshold for detecting nearly flat regions. Acceptable values range from .51 to 64; the default value is 1.2. Out-of-range values will be clipped to the valid range. \n\n**radius**\n\n    The neighborhood to fit the gradient to. A larger radius makes for smoother gradients, but also prevents the filter from modifying the pixels near detailed regions. Acceptable values are 8-32; the default value is 16. Out-of-range values will be clipped to the valid range. \n\nAlternatively, the options can be specified as a flat string:\nstrength[:radius]\n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_gradfun",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "is_support_framesync": false,
  "is_support_timeline": true,
  "name": "gradfun",
  "options": [
    {
      "alias": [
        "strength"
      ],
      "choices": [],
      "default": 1.2,
      "description": "<dd><p>The maximum amount by which the filter will change any one pixel. This is also\nthe threshold for detecting nearly flat regions. Acceptable values range from\n.51 to 64; the default value is 1.2. Out-of-range values will be clipped to the\nvalid range.\n</p>\n</dd>",
      "name": "strength",
      "required": false,
      "typing": "float"
    },
    {
      "alias": [
        "radius"
      ],
      "choices": [],
      "default": 16,
      "description": "<dd><p>The neighborhood to fit the gradient to. A larger radius makes for smoother\ngradients, but also prevents the filter from modifying the pixels near detailed\nregions. Acceptable values are 8-32; the default value is 16. Out-of-range\nvalues will be clipped to the valid range.\n</p>\n</dd>",
      "name": "radius",
      "required": false,
      "typing": "int"
    },
    {
      "alias": [],
      "choices": [],
      "default": null,
      "description": "timeline editing",
      "name": "enable",
      "required": false,
      "typing": "str"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#gradfun"
}
