{
  "description": "### 11.208 removelogo\n\nSuppress a TV station logo, using an image file to determine which pixels\ncomprise the logo. It works by filling in the pixels that comprise the logo\nwith neighboring pixels.\n\nThe filter accepts the following options:\n\n**filename, f**\n\n    Set the filter bitmap file, which can be any image format supported by libavformat. The width and height of the image file must match those of the video stream being processed. \n\nPixels in the provided bitmap image with a value of zero are not considered\npart of the logo, non-zero pixels are considered part of the logo. If you use\nwhite (255) for the logo and black (0) for the rest, you will be safe. For\nmaking the filter bitmap, it is recommended to take a screen capture of a\nblack frame with the logo visible, and then using a threshold filter followed\nby the erode filter once or twice.\n\nIf needed, little splotches can be fixed manually. Remember that if logo\npixels are not covered, the filter quality will be much reduced. Marking too\nmany pixels as part of the logo does not hurt as much, but it will increase\nthe amount of blurring needed to cover over the image and will destroy more\ninformation than necessary, and extra pixels will slow things down on a large\nlogo.\n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_removelogo",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "is_support_timeline": true,
  "name": "removelogo",
  "options": [
    {
      "alias": [
        "filename",
        "f"
      ],
      "choices": [],
      "default": "((void*)0)",
      "description": "<dd><p>Set the filter bitmap file, which can be any image format supported by\nlibavformat. The width and height of the image file must match those of the\nvideo stream being processed.\n</p></dd>",
      "name": "filename",
      "required": false,
      "typing": "str"
    },
    {
      "alias": [],
      "choices": [],
      "default": null,
      "description": "timeline editing",
      "name": "enable",
      "required": false,
      "typing": "str"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#removelogo"
}
