{
  "description": "### 11.56 dctdnoiz\n\nDenoise frames using 2D DCT (frequency domain filtering).\n\nThis filter is not designed for real time.\n\nThe filter accepts the following options:\n\n**sigma, s**\n\n    Set the noise sigma constant. This sigma defines a hard threshold of 3 * sigma; every DCT coefficient (absolute value) below this threshold with be dropped. If you need a more advanced filtering, see expr. Default is 0. \n\n**overlap**\n\n    Set number overlapping pixels for each block. Since the filter can be slow, you may want to reduce this value, at the cost of a less effective filter and the risk of various artefacts. If the overlapping value doesn’t permit processing the whole input width or height, a warning will be displayed and according borders won’t be denoised. Default value is blocksize-1, which is the best possible setting. \n\n**expr, e**\n\n    Set the coefficient factor expression. For each coefficient of a DCT block, this expression will be evaluated as a multiplier value for the coefficient. If this is option is set, the sigma option will be ignored. The absolute value of the coefficient can be accessed through the c variable. \n\n**n**\n\n    Set the blocksize using the number of bits. 1<<n defines the blocksize, which is the width and height of the processed blocks. The default value is 3 (8x8) and can be raised to 4 for a blocksize of 16x16. Note that changing this setting has huge consequences on the speed processing. Also, a larger block size does not necessarily means a better de-noising. \n\n",
  "filter_type": "vf",
  "formula_input_typings": null,
  "formula_output_typings": null,
  "id": "ff_vf_dctdnoiz",
  "input_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "is_input_dynamic": false,
  "is_output_dynamic": false,
  "name": "dctdnoiz",
  "options": [
    {
      "alias": [
        "sigma",
        "s"
      ],
      "choices": [],
      "default": 0.0,
      "description": "<dd><p>Set the noise sigma constant.\n</p>\n<p>This <var>sigma</var> defines a hard threshold of <code>3 * sigma</code>; every DCT\ncoefficient (absolute value) below this threshold with be dropped.\n</p>\n<p>If you need a more advanced filtering, see <samp>expr</samp>.\n</p>\n<p>Default is <code>0</code>.\n</p>\n</dd>",
      "name": "sigma",
      "required": false,
      "typing": "float"
    },
    {
      "alias": [
        "overlap"
      ],
      "choices": [],
      "default": -1,
      "description": "<dd><p>Set number overlapping pixels for each block. Since the filter can be slow, you\nmay want to reduce this value, at the cost of a less effective filter and the\nrisk of various artefacts.\n</p>\n<p>If the overlapping value doesn’t permit processing the whole input width or\nheight, a warning will be displayed and according borders won’t be denoised.\n</p>\n<p>Default value is <var>blocksize</var>-1, which is the best possible setting.\n</p>\n</dd>",
      "name": "overlap",
      "required": false,
      "typing": "int"
    },
    {
      "alias": [
        "expr",
        "e"
      ],
      "choices": [],
      "default": "((void*)0)",
      "description": "<dd><p>Set the coefficient factor expression.\n</p>\n<p>For each coefficient of a DCT block, this expression will be evaluated as a\nmultiplier value for the coefficient.\n</p>\n<p>If this is option is set, the <samp>sigma</samp> option will be ignored.\n</p>\n<p>The absolute value of the coefficient can be accessed through the <var>c</var>\nvariable.\n</p>\n</dd>",
      "name": "expr",
      "required": false,
      "typing": "str"
    },
    {
      "alias": [
        "n"
      ],
      "choices": [],
      "default": 3,
      "description": "<dd><p>Set the <var>blocksize</var> using the number of bits. <code>1&lt;&lt;<var>n</var></code> defines the\n<var>blocksize</var>, which is the width and height of the processed blocks.\n</p>\n<p>The default value is <var>3</var> (8x8) and can be raised to <var>4</var> for a\n<var>blocksize</var> of 16x16. Note that changing this setting has huge consequences\non the speed processing. Also, a larger block size does not necessarily means a\nbetter de-noising.\n</p></dd>",
      "name": "n",
      "required": false,
      "typing": "int"
    }
  ],
  "output_stream_typings": [
    {
      "name": "default",
      "type": "AVMEDIA_TYPE_VIDEO"
    }
  ],
  "ref": "https://ffmpeg.org/ffmpeg-filters.html#dctdnoiz"
}
